In [45]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
import scipy.stats as stats

In [116]:
# 5 variables: yearBorn (2001-3), gender (2016: male 2,272,699, female 2,407,437), dublinYesNo, hrsStudy, points

# counts function
def counts(listArgument):
    elementCount = {}
    for key in listArgument:
        elementCount[key] = elementCount.get(key, 0) + 1
    return elementCount


# yearBorn
yearsBorn = ['2001', '2002', '2003']
yearBorn = np.random.choice(yearsBorn, p=[0.333, 0.333, 0.334], size=200)

# sex
# female = male * 1.0592854575110915
sexChoice = ['male', 'female']
sex = np.random.choice(sexChoice, p=[0.4856053328364817, 0.5143946671635183], size=200)

# dublinYesNo
# total pop = 4680136, Dublin pop = 1,024,027
dublinYesNo = np.random.binomial(1, p=0.21880282966136028, size=200)

# hrsStudy
# normal distribution
mean, std = 25, 5
hrsWeek = np.random.normal(mean, std, 200)
# plt.hist(s, 100)


# Leaving Cert points
points = np.random.normal(400, 50, 200)
# plt.hist(points, 100)

    

# counts(dublinYesNo)

In [117]:
dfpoints = pd.DataFrame(data={'Points': points})
dfpoints = pd.DataFrame.round(dfpoints)

In [118]:
df = pd.DataFrame(data={'Year born': yearBorn, 'M/F': sex, 'Dublin?': dublinYesNo, 'Hours study per week': hrsWeek})
df['Points'] = dfpoints
df

    Year born     M/F  Dublin?  Hours study per week  Points
0        2002  female        0             21.672340   406.0
1        2003  female        0             26.688251   323.0
2        2002  female        1             11.079238   479.0
3        2003  female        0             23.847048   409.0
4        2003    male        0             25.085708   357.0
..        ...     ...      ...                   ...     ...
195      2003    male        0             29.602087   404.0
196      2003    male        1             11.966545   404.0
197      2003  female        0             17.740484   335.0
198      2003    male        0             23.660690   388.0
199      2001    male        1             31.848168   387.0

[200 rows x 5 columns]